zephyrproject-rtos/hal_infineon/aurix/tc3x/Sfr/TC39xB/IfxDom_reg.h
/** \brief 118, SCI 8 Error Capture Register */
#define DOM2_SCICTRL8_ERR /*lint --e(923, 9078)*/ (*(volatile Ifx_DOM_SCICTRL_ERR*)0xFB700118u)
/** Alias (User Manual Name) for DOM2_SCICTRL8_ERR.
* To use register names with standard convension, please use DOM2_SCICTRL8_ERR.
*/
#define DOM2_ERR8 (DOM2_SCICTRL8_ERR)

/** \brief 120, Protocol Error Control Register 9 */
#define DOM2_SCICTRL9_PECON /*lint --e(923, 9078)*/ (*(volatile Ifx_DOM_SCICTRL_PECON*)0xFB700120u)
/** Alias (User Manual Name) for DOM2_SCICTRL9_PECON.
* To use register names with standard convension, please use DOM2_SCICTRL9_PECON.
*/
#define DOM2_PECON9 (DOM2_SCICTRL9_PECON)

/** \brief 128, SCI9 Arbiter Priority Register */
#define DOM2_SCICTRL9_PRIORITY /*lint --e(923, 9078)*/ (*(volatile Ifx_DOM_SCICTRL_PRIORITY*)0xFB700128u)
/** Alias (User Manual Name) for DOM2_SCICTRL9_PRIORITY.
* To use register names with standard convension, please use DOM2_SCICTRL9_PRIORITY.
*/
#define DOM2_PRIORITY9 (DOM2_SCICTRL9_PRIORITY)

/** \brief 130, SCI 9 Error Address Capture Register */
#define DOM2_SCICTRL9_ERRADDR /*lint --e(923, 9078)*/ (*(volatile Ifx_DOM_SCICTRL_ERRADDR*)0xFB700130u)
/** Alias (User Manual Name) for DOM2_SCICTRL9_ERRADDR.
* To use register names with standard convension, please use DOM2_SCICTRL9_ERRADDR.
*/
#define DOM2_ERRADDR9 (DOM2_SCICTRL9_ERRADDR)

/** \brief 138, SCI 9 Error Capture Register */
#define DOM2_SCICTRL9_ERR /*lint --e(923, 9078)*/ (*(volatile Ifx_DOM_SCICTRL_ERR*)0xFB700138u)
/** Alias (User Manual Name) for DOM2_SCICTRL9_ERR.
* To use register names with standard convension, please use DOM2_SCICTRL9_ERR.
*/
#define DOM2_ERR9 (DOM2_SCICTRL9_ERR)

/** \brief 140, Protocol Error Control Register 10 */
#define DOM2_SCICTRL10_PECON /*lint --e(923, 9078)*/ (*(volatile Ifx_DOM_SCICTRL_PECON*)0xFB700140u)
/** Alias (User Manual Name) for DOM2_SCICTRL10_PECON.
* To use register names with standard convension, please use DOM2_SCICTRL10_PECON.
*/
#define DOM2_PECON10 (DOM2_SCICTRL10_PECON)

/** \brief 148, SCI10 Arbiter Priority Register */
#define DOM2_SCICTRL10_PRIORITY /*lint --e(923, 9078)*/ (*(volatile Ifx_DOM_SCICTRL_PRIORITY*)0xFB700148u)
/** Alias (User Manual Name) for DOM2_SCICTRL10_PRIORITY.
* To use register names with standard convension, please use DOM2_SCICTRL10_PRIORITY.
*/
#define DOM2_PRIORITY10 (DOM2_SCICTRL10_PRIORITY)

/** \brief 150, SCI 10 Error Address Capture Register */
#define DOM2_SCICTRL10_ERRADDR /*lint --e(923, 9078)*/ (*(volatile Ifx_DOM_SCICTRL_ERRADDR*)0xFB700150u)
/** Alias (User Manual Name) for DOM2_SCICTRL10_ERRADDR.
* To use register names with standard convension, please use DOM2_SCICTRL10_ERRADDR.
*/
#define DOM2_ERRADDR10 (DOM2_SCICTRL10_ERRADDR)

/** \brief 158, SCI 10 Error Capture Register */
#define DOM2_SCICTRL10_ERR /*lint --e(923, 9078)*/ (*(volatile Ifx_DOM_SCICTRL_ERR*)0xFB700158u)
/** Alias (User Manual Name) for DOM2_SCICTRL10_ERR.
* To use register names with standard convension, please use DOM2_SCICTRL10_ERR.
*/
#define DOM2_ERR10 (DOM2_SCICTRL10_ERR)

/** \brief 160, Protocol Error Control Register 11 */
#define DOM2_SCICTRL11_PECON /*lint --e(923, 9078)*/ (*(volatile Ifx_DOM_SCICTRL_PECON*)0xFB700160u)
/** Alias (User Manual Name) for DOM2_SCICTRL11_PECON.
* To use register names with standard convension, please use DOM2_SCICTRL11_PECON.
*/
#define DOM2_PECON11 (DOM2_SCICTRL11_PECON)

/** \brief 168, SCI11 Arbiter Priority Register */
#define DOM2_SCICTRL11_PRIORITY /*lint --e(923, 9078)*/ (*(volatile Ifx_DOM_SCICTRL_PRIORITY*)0xFB700168u)
/** Alias (User Manual Name) for DOM2_SCICTRL11_PRIORITY.
* To use register names with standard convension, please use DOM2_SCICTRL11_PRIORITY.
*/
#define DOM2_PRIORITY11 (DOM2_SCICTRL11_PRIORITY)

/** \brief 170, SCI 11 Error Address Capture Register */
#define DOM2_SCICTRL11_ERRADDR /*lint --e(923, 9078)*/ (*(volatile Ifx_DOM_SCICTRL_ERRADDR*)0xFB700170u)
/** Alias (User Manual Name) for DOM2_SCICTRL11_ERRADDR.
* To use register names with standard convension, please use DOM2_SCICTRL11_ERRADDR.
*/
#define DOM2_ERRADDR11 (DOM2_SCICTRL11_ERRADDR)

/** \brief 178, SCI 11 Error Capture Register */
#define DOM2_SCICTRL11_ERR /*lint --e(923, 9078)*/ (*(volatile Ifx_DOM_SCICTRL_ERR*)0xFB700178u)
/** Alias (User Manual Name) for DOM2_SCICTRL11_ERR.
* To use register names with standard convension, please use DOM2_SCICTRL11_ERR.
*/
#define DOM2_ERR11 (DOM2_SCICTRL11_ERR)

/** \brief 180, Protocol Error Control Register 12 */
#define DOM2_SCICTRL12_PECON /*lint --e(923, 9078)*/ (*(volatile Ifx_DOM_SCICTRL_PECON*)0xFB700180u)
/** Alias (User Manual Name) for DOM2_SCICTRL12_PECON.
* To use register names with standard convension, please use DOM2_SCICTRL12_PECON.
*/
#define DOM2_PECON12 (DOM2_SCICTRL12_PECON)

/** \brief 188, SCI12 Arbiter Priority Register */
#define DOM2_SCICTRL12_PRIORITY /*lint --e(923, 9078)*/ (*(volatile Ifx_DOM_SCICTRL_PRIORITY*)0xFB700188u)
/** Alias (User Manual Name) for DOM2_SCICTRL12_PRIORITY.
* To use register names with standard convension, please use DOM2_SCICTRL12_PRIORITY.
*/
#define DOM2_PRIORITY12 (DOM2_SCICTRL12_PRIORITY)

/** \brief 190, SCI 12 Error Address Capture Register */
#define DOM2_SCICTRL12_ERRADDR /*lint --e(923, 9078)*/ (*(volatile Ifx_DOM_SCICTRL_ERRADDR*)0xFB700190u)
/** Alias (User Manual Name) for DOM2_SCICTRL12_ERRADDR.
* To use register names with standard convension, please use DOM2_SCICTRL12_ERRADDR.
*/
#define DOM2_ERRADDR12 (DOM2_SCICTRL12_ERRADDR)

/** \brief 198, SCI 12 Error Capture Register */
#define DOM2_SCICTRL12_ERR /*lint --e(923, 9078)*/ (*(volatile Ifx_DOM_SCICTRL_ERR*)0xFB700198u)
/** Alias (User Manual Name) for DOM2_SCICTRL12_ERR.
* To use register names with standard convension, please use DOM2_SCICTRL12_ERR.
*/
#define DOM2_ERR12 (DOM2_SCICTRL12_ERR)

/** \brief 1A0, Protocol Error Control Register 13 */
#define DOM2_SCICTRL13_PECON /*lint --e(923, 9078)*/ (*(volatile Ifx_DOM_SCICTRL_PECON*)0xFB7001A0u)
/** Alias (User Manual Name) for DOM2_SCICTRL13_PECON.
* To use register names with standard convension, please use DOM2_SCICTRL13_PECON.
*/
#define DOM2_PECON13 (DOM2_SCICTRL13_PECON)

