zephyrproject-rtos/hal_infineon/aurix/tc3x/Sfr/TC39xB/IfxDom_reg.h
/** \brief 1A8, SCI13 Arbiter Priority Register */
#define DOM2_SCICTRL13_PRIORITY /*lint --e(923, 9078)*/ (*(volatile Ifx_DOM_SCICTRL_PRIORITY*)0xFB7001A8u)
/** Alias (User Manual Name) for DOM2_SCICTRL13_PRIORITY.
* To use register names with standard convension, please use DOM2_SCICTRL13_PRIORITY.
*/
#define DOM2_PRIORITY13 (DOM2_SCICTRL13_PRIORITY)

/** \brief 1B0, SCI 13 Error Address Capture Register */
#define DOM2_SCICTRL13_ERRADDR /*lint --e(923, 9078)*/ (*(volatile Ifx_DOM_SCICTRL_ERRADDR*)0xFB7001B0u)
/** Alias (User Manual Name) for DOM2_SCICTRL13_ERRADDR.
* To use register names with standard convension, please use DOM2_SCICTRL13_ERRADDR.
*/
#define DOM2_ERRADDR13 (DOM2_SCICTRL13_ERRADDR)

/** \brief 1B8, SCI 13 Error Capture Register */
#define DOM2_SCICTRL13_ERR /*lint --e(923, 9078)*/ (*(volatile Ifx_DOM_SCICTRL_ERR*)0xFB7001B8u)
/** Alias (User Manual Name) for DOM2_SCICTRL13_ERR.
* To use register names with standard convension, please use DOM2_SCICTRL13_ERR.
*/
#define DOM2_ERR13 (DOM2_SCICTRL13_ERR)

/** \brief 1C0, Protocol Error Control Register 14 */
#define DOM2_SCICTRL14_PECON /*lint --e(923, 9078)*/ (*(volatile Ifx_DOM_SCICTRL_PECON*)0xFB7001C0u)
/** Alias (User Manual Name) for DOM2_SCICTRL14_PECON.
* To use register names with standard convension, please use DOM2_SCICTRL14_PECON.
*/
#define DOM2_PECON14 (DOM2_SCICTRL14_PECON)

/** \brief 1C8, SCI14 Arbiter Priority Register */
#define DOM2_SCICTRL14_PRIORITY /*lint --e(923, 9078)*/ (*(volatile Ifx_DOM_SCICTRL_PRIORITY*)0xFB7001C8u)
/** Alias (User Manual Name) for DOM2_SCICTRL14_PRIORITY.
* To use register names with standard convension, please use DOM2_SCICTRL14_PRIORITY.
*/
#define DOM2_PRIORITY14 (DOM2_SCICTRL14_PRIORITY)

/** \brief 1D0, SCI 14 Error Address Capture Register */
#define DOM2_SCICTRL14_ERRADDR /*lint --e(923, 9078)*/ (*(volatile Ifx_DOM_SCICTRL_ERRADDR*)0xFB7001D0u)
/** Alias (User Manual Name) for DOM2_SCICTRL14_ERRADDR.
* To use register names with standard convension, please use DOM2_SCICTRL14_ERRADDR.
*/
#define DOM2_ERRADDR14 (DOM2_SCICTRL14_ERRADDR)

/** \brief 1D8, SCI 14 Error Capture Register */
#define DOM2_SCICTRL14_ERR /*lint --e(923, 9078)*/ (*(volatile Ifx_DOM_SCICTRL_ERR*)0xFB7001D8u)
/** Alias (User Manual Name) for DOM2_SCICTRL14_ERR.
* To use register names with standard convension, please use DOM2_SCICTRL14_ERR.
*/
#define DOM2_ERR14 (DOM2_SCICTRL14_ERR)

/** \brief 1E0, Protocol Error Control Register 15 */
#define DOM2_SCICTRL15_PECON /*lint --e(923, 9078)*/ (*(volatile Ifx_DOM_SCICTRL_PECON*)0xFB7001E0u)
/** Alias (User Manual Name) for DOM2_SCICTRL15_PECON.
* To use register names with standard convension, please use DOM2_SCICTRL15_PECON.
*/
#define DOM2_PECON15 (DOM2_SCICTRL15_PECON)

/** \brief 1E8, SCI15 Arbiter Priority Register */
#define DOM2_SCICTRL15_PRIORITY /*lint --e(923, 9078)*/ (*(volatile Ifx_DOM_SCICTRL_PRIORITY*)0xFB7001E8u)
/** Alias (User Manual Name) for DOM2_SCICTRL15_PRIORITY.
* To use register names with standard convension, please use DOM2_SCICTRL15_PRIORITY.
*/
#define DOM2_PRIORITY15 (DOM2_SCICTRL15_PRIORITY)

/** \brief 1F0, SCI 15 Error Address Capture Register */
#define DOM2_SCICTRL15_ERRADDR /*lint --e(923, 9078)*/ (*(volatile Ifx_DOM_SCICTRL_ERRADDR*)0xFB7001F0u)
/** Alias (User Manual Name) for DOM2_SCICTRL15_ERRADDR.
* To use register names with standard convension, please use DOM2_SCICTRL15_ERRADDR.
*/
#define DOM2_ERRADDR15 (DOM2_SCICTRL15_ERRADDR)

/** \brief 1F8, SCI 15 Error Capture Register */
#define DOM2_SCICTRL15_ERR /*lint --e(923, 9078)*/ (*(volatile Ifx_DOM_SCICTRL_ERR*)0xFB7001F8u)
/** Alias (User Manual Name) for DOM2_SCICTRL15_ERR.
* To use register names with standard convension, please use DOM2_SCICTRL15_ERR.
*/
#define DOM2_ERR15 (DOM2_SCICTRL15_ERR)

/** \brief 408, Identification Register */
#define DOM2_ID /*lint --e(923, 9078)*/ (*(volatile Ifx_DOM_ID*)0xFB700408u)

/** \brief 410, Protocol Error Status Register */
#define DOM2_PESTAT /*lint --e(923, 9078)*/ (*(volatile Ifx_DOM_PESTAT*)0xFB700410u)

/** \brief 418, Transaction ID Status Register */
#define DOM2_TIDSTAT /*lint --e(923, 9078)*/ (*(volatile Ifx_DOM_TIDSTAT*)0xFB700418u)

/** \brief 420, Transaction ID Enable Register */
#define DOM2_TIDEN /*lint --e(923, 9078)*/ (*(volatile Ifx_DOM_TIDEN*)0xFB700420u)

/** \brief 430, Domain 2 Bridge Control Register */
#define DOM2_BRCON /*lint --e(923, 9078)*/ (*(volatile Ifx_DOM_BRCON*)0xFB700430u)

/** \brief 4F0, Access Enable Register 0 */
#define DOM2_ACCEN0 /*lint --e(923, 9078)*/ (*(volatile Ifx_DOM_ACCEN0*)0xFB7004F0u)

/** \brief 4F8, Access Enable Register 1 */
#define DOM2_ACCEN1 /*lint --e(923, 9078)*/ (*(volatile Ifx_DOM_ACCEN1*)0xFB7004F8u)


/** \}  */

/******************************************************************************/

/******************************************************************************/

#endif /* IFXDOM_REG_H */
